#Напишем программу, которая выполняет простые арифметические операции
a = 6                       # переменная типа int
b = 2                       # переменная типа int
n = a+b                     #операция сложение
w = a-b                     #операция вычитание
e = a/b                     #операция деление
t = a*b                     #операция умножение
y = a**b                    #операция возведение в степень
v = a//b                    #операция деление нацело
i =a%b                      #операция остаток от деления

print (n)
print (w)
print (e)
print (t)
print (y)
print (v)
print (i)
