#Необходимо написать программу, которая требует у пользователя ввести два целых числа, строку и одно дробное число, далее выводит на экран строку и сумму двух целых и дробного числа
a = int(input("введите первое целое число:"))
b = int(input("введите второе целое число:"))
c = input("введите строку:")
d = float(input("введите дробное число:"))

#сумма целых чисел и дробного
u = a + b + d

print (c)
print (u)





