#Создать 4 переменных. С типом данных целых чисел, чисел с плавающей точкой, логическим и строковым. Преобразовать числа в строку
a = 1
b = 3.14
c = True
d = "Привет!"


a = str(a)
b = str(b)

print(a)
print(b)
print(c)
print(d)
