# 10. Вывести на экран числа от 0 до 50, кроме 35.
a = 1
for a in range (0,51):
   if a !=35:
        print(a, end=' ')
