# 3. Создать пустую переменную. Проверить ее на истинность и ложность. Объясните полученный результат.
a = int(input())
print(bool(a))
