# 7. Создать список с числами от 1 до 50 используя генератор списков.
a = []
for i in range(1,51):
    a.append(i)
print(a)

