#Творческое задание
#Придумать свою задачу на тему занятия. Обязательно
#использовать несколько вложений if-else(elif)

# Создайте регистрацию пользователя:

print("Регистрация пользователя:")
a = input("Введите Логин:")
b = input("Введите адес электронной почты:")
c = input("Введите Пароль:")

print("Регистрация успешна!")

print("Авторизация пользователя:")
i = input("Введите Логин:")
h = input("Введите Пароль:")

if a==i and c==h:
    print("Верно")
else:
    print("Не верно")











